###Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]

# YOLOv8.0n backbone
backbone:
    # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] #0-P1/2
  - [-1, 2, PKI, [64,64]] # 1

  - [-1, 1, Conv, [128, 3, 2]] # 2
  - [-1, 3, C2f, [128, True]] # 3

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, SCDown, [512, 3, 2]] #
  - [-1, 6, C2f, [512, True]] #7-P4/16

  - [-1, 1, SCDown, [1024, 3, 2]] #
  - [-1, 3, C2fCIB, [1024, True]] #9-P5/32

  - [-1, 1, SPPF, [1024, 5]] #10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [9, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, CAB,[512]]
  - [[-1, 7, 11], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [7, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, CAB,[256]]
  - [[-1, 5, 18], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 24

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [5, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, CAB,[128]]
  - [[-1, 3, 25], 1, Concat, [1]]
  - [-1, 3, C2f, [128]] # 31

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 5, 24], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [256]] # 34 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 37 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]] #
  - [[-1, 9, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 40 (P5/32-large)

  - [[31, 34, 37, 40], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
